joeferner/stm32-wifi-door-bell/firmware/stm32lib/cc3000.c
  if (wlan_set_event_mask(HCI_EVNT_WLAN_UNSOL_INIT        |
                          //HCI_EVNT_WLAN_ASYNC_PING_REPORT |// we want ping reports
                          //HCI_EVNT_BSD_TCP_CLOSE_WAIT |
                          //HCI_EVNT_WLAN_TX_COMPLETE |
                          HCI_EVNT_WLAN_KEEPALIVE) != CC3000_SUCCESS) {
    printf("WLAN Set Event Mask FAIL\n");
    return FALSE;
  }

  // Wait for re-connection if we're using SmartConfig data
  if (connectPolicy & CC3000_CONNECT_POLICY_SMART_CONFIG) {
    // Wait for a connection
    uint32_t timeout = 0;
    while (!_cc3000_status.isConnected) {
      _cc3000_irqPoll();
      if (timeout > WLAN_CONNECT_TIMEOUT) {
        return FALSE;
      }
      timeout += 10;
      delay_ms(10);
    }

    delay_ms(1000);
    if (_cc3000_status.hasDHCP) {
      mdnsAdvertiser(1, (char*) deviceName, strlen(deviceName));
    }
  }

  printf("END CC3000 Setup\n");
  return TRUE;
}

SOCKET cc3000_connectUDP(uint32_t destIP, uint16_t destPort) {
  sockaddr socketAddress;
  SOCKET sock;

  sock = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
  if (-1 == sock) {
    return -1;
  }

  memset(&socketAddress, 0x00, sizeof(socketAddress));
  socketAddress.sa_family = AF_INET;
  socketAddress.sa_data[0] = (destPort & 0xFF00) >> 8;  // Set the Port Number
  socketAddress.sa_data[1] = (destPort & 0x00FF);
  socketAddress.sa_data[2] = destIP >> 24;
  socketAddress.sa_data[3] = destIP >> 16;
  socketAddress.sa_data[4] = destIP >> 8;
  socketAddress.sa_data[5] = destIP;

  if (-1 == connect(sock, &socketAddress, sizeof(socketAddress))) {
    closesocket(sock);
    return -1;
  }

  return sock;
}

BOOL cc3000_socket_connected(SOCKET sock) {
  if (sock < 0) {
    return FALSE;
  }

  if (!cc3000_socket_available(sock) && _cc3000_sockets[sock].closed == TRUE) {
    //if (CC3KPrinter != 0) CC3KPrinter->println("No more data, and closed!");
    closesocket(sock);
    _cc3000_sockets[sock].closed = FALSE;
    sock = -1;
    return FALSE;
  }

  return TRUE;
}

int cc3000_socket_available(SOCKET sockIndex) {
  // not open!
  if (sockIndex < 0) {
    return 0;
  }

  _CC3000Socket* sock = &_cc3000_sockets[sockIndex];

  if ((sock->bufferSize > 0) // we have some data in the internal buffer
      && (sock->rxBufferIndex < sock->bufferSize)) {  // we havent already spit it all out
    return (sock->bufferSize - sock->rxBufferIndex);
  }

  // do a select() call on this socket
  timeval timeout;
  fd_set fd_read;

  memset(&fd_read, 0, sizeof(fd_read));
  FD_SET(sockIndex, &fd_read);

  timeout.tv_sec = 0;
  timeout.tv_usec = 5000; // 5 millisec

  int16_t s = select(sockIndex + 1, &fd_read, NULL, NULL, &timeout);
  if (s == 1) {
    return 1; // some data is available to read
  }
  return 0; // no data is available
}

int cc3000_socket_write(SOCKET sock, const void* buf, uint16_t len, uint32_t flags) {
  return send(sock, buf, len, flags);
}

int cc3000_socket_read(SOCKET sock, void* buf, uint16_t len, uint32_t flags) {
  return recv(sock, buf, len, flags);
}

BOOL cc3000_socket_close(SOCKET sock) {
  return closesocket(sock);
}


void _cc3000_cs_assert() {
  GPIO_ResetBits(CC3000_CS, CC3000_CS_PIN);
}

void _cc3000_cs_deassert() {
  GPIO_SetBits(CC3000_CS, CC3000_CS_PIN);
}

void _cc3000_en_assert() {
  GPIO_SetBits(CC3000_EN, CC3000_EN_PIN);
}

void _cc3000_en_deassert() {
  GPIO_ResetBits(CC3000_EN, CC3000_EN_PIN);
}

extern void SpiReceiveHandler(void* pvBuffer);

BOOL _cc3000_getFirmwareVersion(uint8_t* major, uint8_t* minor) {
  uint8_t fwpReturn[2];

  if (nvmem_read_sp_version(fwpReturn) != CC3000_SUCCESS) {
    printf("Unable to read the firmware version\n");
    return FALSE;
  }

  *major = fwpReturn[0];
  *minor = fwpReturn[1];

  return TRUE;
}

BOOL cc3000_deleteAllProfiles() {
  printf("deleting profiles\n");
  return wlan_ioctl_del_profile(255) == 0;
}

BOOL cc3000_addProfile(const char* ssid, const char* key, uint8_t secmode) {
  uint32_t ulPriority = 0;

  // taken from wlan.c WPA smart config example
  uint32_t ulPairwiseCipher_Or_TxKeyLen = 0x18;
  uint32_t ulGroupCipher_TxKeyIndex = 0x1e;
  uint32_t ulKeyMgmt = 0x2;

  int32_t result = wlan_add_profile(secmode, (uint8_t*)ssid, strlen(ssid), NULL, ulPriority, ulPairwiseCipher_Or_TxKeyLen, ulGroupCipher_TxKeyIndex, ulKeyMgmt, (uint8_t*)key, strlen(key));
  if (result == -1) {
    printf("failed to add profile %ld\n", result);
    return FALSE;
  }
  return TRUE;
}

BOOL cc3000_finishAddProfileAndConnect() {
  int connectToOpenAPs = 1;
  int useFastConnect = 1;
  int useProfiles = 1;
  if (wlan_ioctl_set_connection_policy(connectToOpenAPs, useFastConnect, useProfiles) != CC3000_SUCCESS) {
    printf("failed to set connection policy\n");
    return FALSE;
  }

  wlan_stop();
  delay_ms(100);

  BOOL patchAvailable = FALSE;
  wlan_start(patchAvailable);

  int16_t timer = WLAN_CONNECT_TIMEOUT;
  while (!_cc3000_status.isConnected) {
    delay_ms(10);
    timer -= 10;
    if (timer <= 0) {
      printf("Timed out!\n");
      return FALSE;
    }
    _cc3000_irqPoll();
  }
  return TRUE;
}

BOOL cc3000_connectToAP(const char* ssid, const char* key, uint8_t secmode) {
  int16_t timer;

  do {
    _cc3000_irqPoll();

    /* MEME: not sure why this is absolutely required but the cc3k freaks
       if you dont. maybe bootup delay? */
    // Setup a 4 second SSID scan
    _cc3000_scanSSIDs(4000);
    // Wait for results
    delay_ms(4500);
    _cc3000_scanSSIDs(0);

    /* Attempt to connect to an access point */
    printf("Connecting to '%s' (key: '%s', security: '%d')\n", ssid, key, secmode);
    if ((secmode == 0) || (strlen(key) == 0)) {
      /* Connect to an unsecured network */
      if (!_cc3000_connectOpen(ssid)) {
        printf("Failed to connect\n");
        continue;
      }
    } else {
      /* Connect to a secure network using WPA2, etc */
      if (!_cc3000_connectSecure(ssid, key, secmode)) {
        printf("Failed to connect\n");
        continue;
      }
    }

    timer = WLAN_CONNECT_TIMEOUT;

