joeferner/stm32-wifi-door-bell/firmware/stm32lib/cc3000.c
    /* Wait around a bit for the async connected signal to arrive or timeout */
    printf("Waiting to connect...\n");
    while ((timer > 0) && !_cc3000_status.isConnected) {
      _cc3000_irqPoll();
      delay_ms(10);
      timer -= 10;
    }
    if (timer <= 0) {
      printf("Timed out!\n");
    }
  } while (!_cc3000_status.isConnected);

  return TRUE;
}

BOOL cc3000_checkDHCP() {
  // Ugly hack to fix UDP issues with the 1.13 firmware by calling
  // gethostbyname on localhost.  The output is completely ignored
  // but for some reason this call is necessary or else UDP won't
  // work.  See this thread from TI for more details and the genesis
  // of the workaround: http://e2e.ti.com/support/wireless_connectivity/f/851/t/342177.aspx
  // Putting this in checkDHCP is a nice way to make it just work
  // for people without any need to add to their sketch.
  if (_cc3000_status.hasDHCP) {
    uint32_t output;
    gethostbyname("localhost", 9, &output);
  }
  return _cc3000_status.hasDHCP;
}

BOOL cc3000_getIPAddress(uint32_t* retip, uint32_t* netmask, uint32_t* gateway, uint32_t* dhcpserv, uint32_t* dnsserv) {
  if (!_cc3000_status.isConnected) {
    return FALSE;
  }
  if (!_cc3000_status.hasDHCP) {
    return FALSE;
  }

  tNetappIpconfigRetArgs ipconfig;
  netapp_ipconfig(&ipconfig);

  /* If byte 1 is 0 we don't have a valid address */
  if (ipconfig.aucIP[3] == 0) {
    return FALSE;
  }

  memcpy(retip, ipconfig.aucIP, 4);
  memcpy(netmask, ipconfig.aucSubnetMask, 4);
  memcpy(gateway, ipconfig.aucDefaultGateway, 4);
  memcpy(dhcpserv, ipconfig.aucDHCPServer, 4);
  memcpy(dnsserv, ipconfig.aucDNSServer, 4);

  return TRUE;
}

BOOL cc3000_getMacAddress(uint8_t* macAddress) {
  return nvmem_read(NVMEM_MAC_FILEID, 6, 0, macAddress) == CC3000_SUCCESS;
}

char* cc3000_ipToString(uint32_t ip, char* buffer) {
  sprintf(buffer, "%d.%d.%d.%d", (uint8_t)(ip >> 24), (uint8_t)(ip >> 16), (uint8_t)(ip >> 8), (uint8_t)(ip >> 0));
  return buffer;
}

BOOL _cc3000_scanSSIDs(uint32_t time) {
  const unsigned long intervalTime[16] = { 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000 };

  // We can abort a scan with a time of 0
  if (time) {
    printf("Started AP/SSID scan\n");
  }

  // Set  SSID Scan params to includes channels above 11
  if (wlan_ioctl_set_scan_params(time, 20, 100, 5, 0x1FFF, -120, 0, 300, (unsigned long*) &intervalTime) != CC3000_SUCCESS) {
    printf("Failed setting params for SSID scan\n");
    return FALSE;
  }

  return TRUE;
}

BOOL _cc3000_connectOpen(const char* ssid) {
  if (wlan_ioctl_set_connection_policy(0, 0, 0) != CC3000_SUCCESS) {
    printf("Failed to set connection policy\n");
    return FALSE;
  }
  delay_ms(500);
  if (wlan_connect(WLAN_SEC_UNSEC, (char*)ssid, strlen(ssid), 0 , NULL, 0) != CC3000_SUCCESS) {
    printf("SSID connection failed\n");
    return FALSE;
  }
  return TRUE;
}

BOOL _cc3000_connectSecure(const char* ssid, const char* key, int32_t secMode) {
  if ((secMode < 0) || (secMode > 3)) {
    printf("Security mode must be between 0 and 3\n");
    return FALSE;
  }

  if (strlen(ssid) > MAXSSID) {
    printf("SSID length must be < %d", MAXSSID);
    return FALSE;
  }

  if (strlen(key) > MAXLENGTHKEY) {
    printf("Key length must be < %d", MAXLENGTHKEY);
    return FALSE;
  }

  if (wlan_ioctl_set_connection_policy(0, 0, 0) != CC3000_SUCCESS) {
    printf("Failed setting the connection policy\n");
    return FALSE;
  };
  delay_ms(500);
  if (wlan_connect(secMode, (char*)ssid, strlen(ssid), NULL, (unsigned char*)key, strlen(key)) != CC3000_SUCCESS) {
    printf("SSID connection failed\n");
    return FALSE;
  }

  /* Wait for 'HCI_EVNT_WLAN_UNSOL_CONNECT' in CC3000_UsynchCallback */
  return TRUE;
}

void _cc3000_asyncCallback(long lEventType, char* data, unsigned char length) {
  if (lEventType == HCI_EVNT_WLAN_ASYNC_SIMPLE_CONFIG_DONE) {
    _cc3000_status.isSmartConfigFinished = TRUE;
  } else if (lEventType == HCI_EVNT_WLAN_UNSOL_CONNECT) {
    _cc3000_status.isConnected = TRUE;
  } else if (lEventType == HCI_EVNT_WLAN_UNSOL_DISCONNECT) {
    _cc3000_status.isConnected = FALSE;
    _cc3000_status.hasDHCP = FALSE;
  } else if (lEventType == HCI_EVNT_WLAN_UNSOL_DHCP) {
    _cc3000_status.hasDHCP = TRUE;
  } else if (lEventType == HCI_EVENT_CC3000_CAN_SHUT_DOWN) {
    _cc3000_status.okToShutdown = TRUE;
  } else if (lEventType == HCI_EVNT_WLAN_ASYNC_PING_REPORT) {
    _cc3000_pingReportNum++;
    memcpy(&_cc3000_pingReport, data, length);
  } else if (lEventType == HCI_EVNT_BSD_TCP_CLOSE_WAIT) {
    uint8_t socketnum;
    socketnum = data[0];
    if (socketnum < MAX_SOCKETS) {
      _cc3000_sockets[socketnum].closed = TRUE;
    }
  }
}

char* _cc3000_sendFWPatches(unsigned long* length) {
  *length = 0;
  return NULL;
}

char* _cc3000_sendDriverPatches(unsigned long* length) {
  *length = 0;
  return NULL;
}

char* _cc3000_sendBootLoaderPatches(unsigned long* length) {
  *length = 0;
  return NULL;
}

long _cc3000_readWlanInterruptPin() {
  return GPIO_ReadInputDataBit(CC3000_IRQ, CC3000_IRQ_PIN) == Bit_SET;
}

void _cc3000_wlanInterruptEnable() {
  EXTI_InitTypeDef extiInitStructure;
  NVIC_InitTypeDef nvicInitStructure;

  GPIO_EXTILineConfig(CC3000_IRQ_EXTI_PORT, CC3000_IRQ_EXTI_PIN);

  EXTI_StructInit(&extiInitStructure);
  extiInitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  extiInitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
  extiInitStructure.EXTI_LineCmd = ENABLE;
  extiInitStructure.EXTI_Line = CC3000_IRQ_EXTI_LINE;
  EXTI_Init(&extiInitStructure);

  nvicInitStructure.NVIC_IRQChannel = CC3000_IRQ_EXTI_CH;
  nvicInitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
  nvicInitStructure.NVIC_IRQChannelSubPriority = 0x0F;
  nvicInitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&nvicInitStructure);

  _cc3000_irqEnabled = TRUE;
}

void _cc3000_wlanInterruptDisable() {
  EXTI_InitTypeDef extiInitStructure;

  EXTI_StructInit(&extiInitStructure);
  extiInitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  extiInitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
  extiInitStructure.EXTI_LineCmd = DISABLE;
  extiInitStructure.EXTI_Line = CC3000_IRQ_EXTI_LINE;
  EXTI_Init(&extiInitStructure);

