joeferner/stm32-wifi-door-bell/firmware/stm32lib/cc3000.c
  _cc3000_irqEnabled = FALSE;
}

void _cc3000_writeWlanPin(unsigned char val) {
  if (val) {
    GPIO_SetBits(CC3000_EN, CC3000_EN_PIN);
  } else {
    GPIO_ResetBits(CC3000_EN, CC3000_EN_PIN);
  }
}

uint8_t _cc3000_spiTransfer(uint8_t d) {
  return spi_transfer(CC3000_SPI, d);
}

void _cc3000_spiReadHeader() {
  _cc3000_spiReadDataSynchronous(_cc3000_spiInformation.rxPacket, CC3000_HEADERS_SIZE_EVNT);
}

void _cc3000_spiReadDataSynchronous(uint8_t* data, uint16_t size) {
  unsigned short i = 0;

  for (i = 0; i < size; i ++) {
    data[i] = _cc3000_spiTransfer(0x03);
  }
}

void _cc3000_ssiContReadOperation() {
  /* The header was read - continue with  the payload read */
  if (_cc3000_spiReadDataCont()) {
    /* All the data was read - finalize handling by switching to teh task
     *  and calling from task Event Handler */
    _cc3000_spiTriggerRxProcessing();
  }
}

void _cc3000_spiTriggerRxProcessing() {
  /* Trigger Rx processing */
  _cc3000_wlanInterruptDisable();
  _cc3000_cs_deassert();

  /* The magic number that resides at the end of the TX/RX buffer (1 byte after the allocated size)
   * for the purpose of detection of the overrun. If the magic number is overriten - buffer overrun
   * occurred - and we will stuck here forever! */
  if (_cc3000_spiInformation.rxPacket[CC3000_RX_BUFFER_SIZE - 1] != CC3000_BUFFER_MAGIC_NUMBER) {
    /* You've got problems if you're here! */
    printf("CC3000: ERROR - magic number missing!\n");
    while (1);
  }

  _cc3000_spiInformation.spiState = CC3000_SPI_STATE_IDLE;
  _cc3000_spiInformation.spiRxHandler(_cc3000_spiInformation.rxPacket + SPI_HEADER_SIZE);
}

BOOL _cc3000_spiReadDataCont() {
  long data_to_recv;
  uint8_t* evnt_buff, type;

  /* Determine what type of packet we have */
  evnt_buff = _cc3000_spiInformation.rxPacket;
  data_to_recv = 0;
  STREAM_TO_UINT8((uint8_t*)(evnt_buff + SPI_HEADER_SIZE), HCI_PACKET_TYPE_OFFSET, type);

  switch (type) {
    case HCI_TYPE_DATA: {
      /* We need to read the rest of data.. */
      STREAM_TO_UINT16((char*)(evnt_buff + SPI_HEADER_SIZE), HCI_DATA_LENGTH_OFFSET, data_to_recv);
      if (!((CC3000_HEADERS_SIZE_EVNT + data_to_recv) & 1)) {
        data_to_recv++;
      }

      if (data_to_recv) {
        _cc3000_spiReadDataSynchronous(evnt_buff + CC3000_HEADERS_SIZE_EVNT, data_to_recv);
      }
      break;
    }
    case HCI_TYPE_EVNT: {
      /* Calculate the rest length of the data */
      STREAM_TO_UINT8((char*)(evnt_buff + SPI_HEADER_SIZE), HCI_EVENT_LENGTH_OFFSET, data_to_recv);
      data_to_recv -= 1;

      /* Add padding byte if needed */
      if ((CC3000_HEADERS_SIZE_EVNT + data_to_recv) & 1) {
        data_to_recv++;
      }

      if (data_to_recv) {
        _cc3000_spiReadDataSynchronous(evnt_buff + CC3000_HEADERS_SIZE_EVNT, data_to_recv);
      }

      _cc3000_spiInformation.spiState = CC3000_SPI_STATE_READ_EOT;
      break;
    }
  }

  return TRUE;
}

void _cc3000_spiWriteDataSynchronous(uint8_t* data, uint16_t size) {
  uint16_t loc;
  for (loc = 0; loc < size; loc ++) {
    _cc3000_spiTransfer(data[loc]);
  }
}

void _cc3000_spiOpen(_cc3000_spiHandleRx rxHandler) {
  _cc3000_spiInformation.spiState = CC3000_SPI_STATE_POWERUP;

  memset(spi_buffer, 0, sizeof(spi_buffer));
  memset(wlan_tx_buffer, 0, sizeof(wlan_tx_buffer));

  _cc3000_spiInformation.spiRxHandler = rxHandler;
  _cc3000_spiInformation.txPacketLength = 0;
  _cc3000_spiInformation.txPacket = NULL;
  _cc3000_spiInformation.rxPacket = spi_buffer;
  _cc3000_spiInformation.rxPacketLength = 0;

  spi_buffer[CC3000_RX_BUFFER_SIZE - 1] = CC3000_BUFFER_MAGIC_NUMBER;
  wlan_tx_buffer[CC3000_TX_BUFFER_SIZE - 1] = CC3000_BUFFER_MAGIC_NUMBER;

  /* Enable interrupt on the GPIO pin of WLAN IRQ */
  tSLInformation.WlanInterruptEnable();
}

void _cc3000_spiClose() {
  if (_cc3000_spiInformation.rxPacket) {
    _cc3000_spiInformation.rxPacket = 0;
  }

  _cc3000_wlanInterruptDisable();
}

void _cc3000_spiResume() {
  _cc3000_wlanInterruptEnable();
}

void _cc3000_spiFirstWrite(uint8_t* buffer, uint16_t length) {
  /* Workaround for the first transaction */
  _cc3000_cs_assert();

  /* delay (stay low) for ~50us */
  delay_ms(1);

  /* SPI writes first 4 bytes of data */
  _cc3000_spiWriteDataSynchronous(buffer, 4);

  delay_ms(1);

  _cc3000_spiWriteDataSynchronous(buffer + 4, length - 4);

  /* From this point on - operate in a regular manner */
  _cc3000_spiInformation.spiState = CC3000_SPI_STATE_IDLE;

  _cc3000_cs_deassert();
}

void _cc3000_spiWrite(uint8_t* buffer, uint16_t length) {
  uint8_t ucPad = 0;

  /* Figure out the total length of the packet in order to figure out if there is padding or not */
  if (!(length & 0x0001)) {
    ucPad++;
  }

  buffer[0] = CC3000_WRITE;
  buffer[1] = CC3000_HI(length + ucPad);
  buffer[2] = CC3000_LO(length + ucPad);
  buffer[3] = 0;
  buffer[4] = 0;

  length += (SPI_HEADER_SIZE + ucPad);

  /* The magic number that resides at the end of the TX/RX buffer (1 byte after the allocated size)
   * for the purpose of overrun detection. If the magic number is overwritten - buffer overrun
   * occurred - and we will be stuck here forever! */
  if (wlan_tx_buffer[CC3000_TX_BUFFER_SIZE - 1] != CC3000_BUFFER_MAGIC_NUMBER) {
    printf("CC3000: Error - No magic number found in SpiWrite\n");
    while (1);
  }

  if (_cc3000_spiInformation.spiState == CC3000_SPI_STATE_POWERUP) {
    while (_cc3000_spiInformation.spiState != CC3000_SPI_STATE_INITIALIZED);
  }

  if (_cc3000_spiInformation.spiState == CC3000_SPI_STATE_INITIALIZED) {
    /* This is time for first TX/RX transactions over SPI: the IRQ is down - so need to send read buffer size command */
    _cc3000_spiFirstWrite(buffer, length);
  } else {
    /* We need to prevent here race that can occur in case two back to back packets are sent to the
     * device, so the state will move to IDLE and once again to not IDLE due to IRQ */
    tSLInformation.WlanInterruptDisable();

    while (_cc3000_spiInformation.spiState != CC3000_SPI_STATE_IDLE);

    _cc3000_spiInformation.spiState = CC3000_SPI_STATE_WRITE_IRQ;
    _cc3000_spiInformation.txPacket = buffer;
    _cc3000_spiInformation.txPacketLength = length;

    /* Assert the CS line and wait till SSI IRQ line is active and then initialize write operation */
    _cc3000_cs_assert();

    /* Re-enable IRQ - if it was not disabled - this is not a problem... */
    tSLInformation.WlanInterruptEnable();

    /* Check for a missing interrupt between the CS assertion and enabling back the interrupts */
    if (tSLInformation.ReadWlanInterruptPin() == 0) {
      _cc3000_spiWriteDataSynchronous(_cc3000_spiInformation.txPacket, _cc3000_spiInformation.txPacketLength);

      _cc3000_spiInformation.spiState = CC3000_SPI_STATE_IDLE;

