joeferner/stm32-wifi-door-bell/firmware/stm32lib/cc3000.c
      _cc3000_cs_deassert();
#ifdef SPI_HAS_TRANSACTION
      WlanInterruptEnable();
#endif
    }
  }

  /* Due to the fact that we are currently implementing a blocking situation
   * here we will wait till end of transaction */
  while (CC3000_SPI_STATE_IDLE != _cc3000_spiInformation.spiState);
}

void _cc3000_irqPoll() {
  if ((_cc3000_readWlanInterruptPin() == Bit_RESET) && !_cc3000_inIrq && _cc3000_irqEnabled) {
    _cc3000_irq();
  }
}

void _cc3000_irq() {
  _cc3000_inIrq = TRUE;

  if (_cc3000_spiInformation.spiState == CC3000_SPI_STATE_POWERUP) {
    /* IRQ line was low ... perform a callback on the HCI Layer */
    _cc3000_spiInformation.spiState = CC3000_SPI_STATE_INITIALIZED;
  } else if (_cc3000_spiInformation.spiState == CC3000_SPI_STATE_IDLE) {
    _cc3000_spiInformation.spiState = CC3000_SPI_STATE_READ_IRQ;

    /* IRQ line goes down - start reception */
    _cc3000_cs_assert();

    // Wait for TX/RX Compete which will come as DMA interrupt
    _cc3000_spiReadHeader();
    _cc3000_spiInformation.spiState = CC3000_SPI_STATE_READ_EOT;
    _cc3000_ssiContReadOperation();
  } else if (_cc3000_spiInformation.spiState == CC3000_SPI_STATE_WRITE_IRQ) {
    _cc3000_spiWriteDataSynchronous(_cc3000_spiInformation.txPacket, _cc3000_spiInformation.txPacketLength);
    _cc3000_spiInformation.spiState = CC3000_SPI_STATE_IDLE;
    _cc3000_cs_deassert();
  }

  _cc3000_inIrq = FALSE;
}

uint32_t inet_addr(const char* cp) {
  in_addr val;
  if (inet_aton(cp, &val)) {
    return (val.s_addr);
  }
  return (INADDR_NONE);
}

int inet_aton(const char* cp, in_addr* addr) {
  uint32_t val;
  int base, n;
  int c;
  uint parts[4];
  uint* pp = parts;

  c = *cp;
  for (;;) {
    /*
     * Collect number up to ``.''.
     * Values are specified as for C:
     * 0x=hex, 0=octal, isdigit=decimal.
     */
    if (!isdigit(c)) {
      return (0);
    }
    val = 0;
    base = 10;
    if (c == '0') {
      c = *++cp;
      if (c == 'x' || c == 'X') {
        base = 16, c = *++cp;
      } else {
        base = 8;
      }
    }
    for (;;) {
      if (isascii(c) && isdigit(c)) {
        val = (val * base) + (c - '0');
        c = *++cp;
      } else if (base == 16 && isascii(c) && isxdigit(c)) {
        val = (val << 4) | (c + 10 - (islower(c) ? 'a' : 'A'));
        c = *++cp;
      } else {
        break;
      }
    }
    if (c == '.') {
      /*
       * Internet format:
       *	a.b.c.d
       *	a.b.c	(with c treated as 16 bits)
       *	a.b	(with b treated as 24 bits)
       */
      if (pp >= parts + 3) {
        return (0);
      }
      *pp++ = val;
      c = *++cp;
    } else {
      break;
    }
  }
  /*
   * Check for trailing characters.
   */
  if (c != '\0' && (!isascii(c) || !isspace(c))) {
    return (0);
  }
  /*
   * Concoct the address according to
   * the number of parts specified.
   */
  n = pp - parts + 1;
  switch (n) {
    case 0:
      return (0); /* initial nondigit */

    case 1: /* a -- 32 bits */
      break;

    case 2: /* a.b -- 8.24 bits */
      if (val > 0xffffff) {
        return (0);
      }
      val |= parts[0] << 24;
      break;

    case 3: /* a.b.c -- 8.8.16 bits */
      if (val > 0xffff) {
        return (0);
      }
      val |= (parts[0] << 24) | (parts[1] << 16);
      break;

    case 4: /* a.b.c.d -- 8.8.8.8 bits */
      if (val > 0xff) {
        return (0);
      }
      val |= (parts[0] << 24) | (parts[1] << 16) | (parts[2] << 8);
      break;
  }
  if (addr) {
    addr->s_addr = htonl(val);
  }
  return (1);
}

#endif


